month = int(input("Введите месяц в виде целого числа от 1 до 12: "))
if int(month) < 1 or int(month) > 12:
    month = int(input("Число неверное. Введите заново месяц в виде целого числа от 1 до 12: "))
my_dict = {1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето", 7: "лето", 8: "лето", 9: "осень", 10: "осень", 11: "осень", 12: "зима"}
print("Сейчас " + my_dict.get(month))

my_list = ["зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень", "осень", "зима"]
print ("Сейчас " + my_list[month - 1])

